       fd  members.
       01  reg-members.
           02 ch-members.
              03 login      pic x(60).
           02 password      pic x(120).
           02 name          pic x(120).
           02 phone         pic x(120).
